package _20230330;

/**
 * 多维数组
 */
public class _0330_2 {
    public static void main(String[] args) {
        /**
         * 定义：
         *      数据类型[][] 数组名 = new 数据类型[一维长度][二维长度]；
         *      int[][] arrs = new int[3][3];
         * 长度： 一维也高维，长度必须指定，二维长度可以不指定。
         * 显示初始化：
         *         数据类型[][] 数组名 = {{1,2,3},{4,5,6},{7,8,9}};
         * 混合使用：
         *         数据类型[][] 数组名 = new 数据类型[][]{{1,2,3},{4,5,6},{7,8,9}};
         * 便利： 使用双重for 循环
         */
        //定义一个二维数组
        int[][] arrs = new int[3][3];//相当于一个3行、3列的表格
        //显示初始化定义一个二维数组
        int[][] as = {{1,2,3},{4,5,6},{7,8,9}};

    }
}
